---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndAttachmentRefcolumnEnd
source: html/ba0bb94a-3a88-701c-06f7-edbab2d05708.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndAttachmentRefcolumnEnd Property

"End of Attachment to Reference Column"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamEndAttachmentRefcolumnEnd { get; }
```